"use strict";

/*
Необходимо попросить пользователя ввести число.
Если пользователь ввел отличное от числа значение, необходимо вывести в консоль
строку: "Значение задано неверно", иначе необходимо будет вызвать функцию 
(нужно будет ее создать), которая будет принимать введенное пользователем 
число. Функция должна вычесть из переданного ей числа 13% и вывести в консоль 
сообщение "Размер заработной платы за вычетом налогов равен N."
*/

const incomingNumber = Number(prompt("Введите число: "));

const salaryCalculator = (salaryGross) => {return Math.round(salaryGross * 0.87 * 100) / 100};

if (isNaN(incomingNumber)) {
    console.log("Значение задано неверно.");
} else {
    console.log(`Размер заработной платы за вычетом налогов равен ${salaryCalculator(incomingNumber)}`);
}
